var qq_str = '{"q1":[{"qus":"程式設計可以做什麼 ?","opt":[["製作應用程式"],["設計'+
'遊戲"],["以上皆是",1]]},{"qus":"學習程式設計，可以培養什麼能力 ?","opt"'+
':[["運算思維",1],["聽說能力"],["體能"]]},{"qus":"在Scratch中，如'+
'何刪除角色 ?","opt":[["在角色上按刪除",1],["拖曳到積木區"],["在造型區刪除"'+
']]},{"qus":"在Scratch中，執行程式，要按 ?","opt":[["[image1]'+
'",1],["[image2]"],["[image3]"]]},{"qus":"在Scratch中'+
'，按哪個按鈕可以全螢幕執行程式 ?","opt":[["[image1]"],["[image2]"'+
'],["[image3]",1]]}],"q2":[{"qus":"[image60]何者造型變換的'+
'速度會較快 ? ","opt":[["速度相同"],["2秒"],["1秒",1]]},{"qus"'+
':"想讓角色說話，要用哪個積木 ?","opt":[["[image63]"],["[image70'+
']"],["[image66]",1]]},{"qus":"編輯造型時，使用哪一種工具可以隨意塗鴉 '+
'?","opt":[["[image73]"],["[image71]"],["[image68]"'+
',1]]},{"qus":"在流程圖中，菱形代表什麼意義 ? ","opt":[["循序的步驟"],'+
'["開始執行"],["判斷的步驟",1]]},{"qus":"在寫程式時發現並解決問題的過程，稱之為'+
'什麼 ?","opt":[["控制"],["迴圈"],["除錯",1]]}],"q3":[{"qus'+
'":"哪一個座標解釋是錯誤的 ?","opt":[["水平軸是 x 座標"],["原點座標是 x:0'+
' , y:0"],["y 座標是左右",1]]},{"qus":"哪一個是【條件式】積木 ?","o'+
'pt":[["重複無限次"],["拖曳方式設為..."],["如果 那麼",1]]},{"qus":'+
'"以下哪個積木可以放入【如果 那麼】積木的六角格裡 ? ","opt":[["[image77]"]'+
',["[image79]"],["[image75]",1]]},{"qus":"想將被遮住的角色顯'+
'示在上方，可用哪個積木 ? ","opt":[["[image80]"],["[image81]"]'+
',["[image82]",1]]},{"qus":"下面哪一組積木可以讓角色碰到鼠標，會不斷變換造'+
'型 ?","opt":[["[image47]"],["[image45]"],["[image43'+
']",1]]}],"q4":[{"qus":"想讓角色 A 指揮角色 B 做事，該使用哪個積木 ? '+
'","opt":[["當收到訊息..."],["說出..."],["廣播訊息...",1]]},{"'+
'qus":"想讓程式組排列整齊，該怎麼做 ? ","opt":[["刪除積木"],["添加註解"],'+
'["整理積木",1]]},{"qus":"下面哪一組積木的效果，明顯與其他不同 ?","opt":['+
'["[image52]"],["[image37]"],["[image50]",1]]},{"qu'+
's":"如果想讓整個專案停止執行程式，應該用哪個積木 ? ","opt":[["[image56]"'+
'],["[image55]"],["[image54]",1]]},{"qus":"想將角色 A 的'+
'程式複製給角色 B ，該怎麼做 ?","opt":[["按右鍵複製"],["按一下左鍵"],["將積'+
'木拖曳到角色 B",1]]}],"q5":[{"qus":"下列哪一個積木會讓角色縮小 ? ","o'+
'pt":[["[image21]"],["[image57]"],["以上皆可",1]]},{"qu'+
's":"哪個積木組，可以讓角色做出旋轉動畫 ?","opt":[["[image27]"],["[i'+
'mage23]"],["[image25]",1]]},{"qus":"[image29]圖中的蘋果'+
'角色，是用了哪一個積木 ? ","opt":[["[image31]"],["[image34]"]'+
',["[image33]",1]]},{"qus":"下列哪一個積木可以讓舞臺上不出現這個角色 ?"'+
',"opt":[["[image63]"],["[image36]"],["[image35]",1'+
']]},{"qus":"執行下列哪一個積木並沒有換背景 ?","opt":[["[image9]"]'+
',["[image8]"],["[image7]",1]]}],"q6":[{"qus":"若想在三'+
'個數字中抽一個數字，哪一個積木是對的 ? ","opt":[["[image12]"],["[ima'+
'ge11]"],["[image10]",1]]},{"qus":"下列哪一個積木可以讓得分漸漸增加'+
' ?","opt":[["[image15]"],["[image13]"],["[image14]'+
'",1]]},{"qus":"如果 X=53，Y=67，Z=43，那下列哪一個積木是正確的 ?","'+
'opt":[["[image59]"],["[image61]"],["[image62]",1]]'+
'},{"qus":"下列哪一個積木，在執行時會要求使用者輸入資料 ? ","opt":[["[ima'+
'ge67]"],["[image69]"],["[image64]",1]]},{"qus":"[i'+
'mage72]執行的結果 ?","opt":[["變數 =1"],["變數 +1"],["變數 -1'+
'",1]]}],"q7":[{"qus":"下列哪一個積木，取得的數字不可能有 5 ?","opt"'+
':[["[image76]"],["[image74]"],["[image78]",1]]},{"'+
'qus":"[image58]這個積木會讓角色說什麼 ?","opt":[["20 顆蘋果"],["'+
'0.5 顆蘋果"],["5 顆蘋果",1]]},{"qus":"[image40]這個積木是指什麼字'+
'母 ?","opt":[["v"],["o"],["l",1]]},{"qus":"如果要使[ima'+
'ge41][image42]這兩個積木組合起來，可以讓【答對】可能是 4 或 5，應該用下面哪一個積'+
'木 ?","opt":[["[image44]"],["[image48]"],["[image46'+
']",1]]},{"qus":"想要使用 Scratch 基本程式以外的其他功能，要按 ?","op'+
't":[["[image51]"],["[image53]"],["[image49]",1]]}]'+
',"q8":[{"qus":"當需要產生很多相同的角色時，可以使用以下哪個積木 ? ","opt":'+
'[["[image38]"],["[image16]"],["[image19]",1]]},{"q'+
'us":"下列何者可以將計時器歸零 ?","opt":[["[image24]"],["[image'+
'22]"],["[image20]",1]]},{"qus":"下列何者可得到數字 3 ? ","o'+
'pt":[["[image26]"],["[image30]"],["[image28]",1]]}'+
',{"qus":"【當黑棋碰到白棋】，黑棋的程式應使用下列何者 ? ","opt":[["[imag'+
'e32]"],["[image16]"],["[image17]",1]]},{"qus":"下列何'+
'者可以發出【Do】的音 ? ","opt":[["[image6]"],["[image18]"],'+
'["[image4]",1]]}]}';